GopalSaraf/Practicals/PSDL/include/proc/pic16lf15345.h
extern volatile SSP1SSPPSbits_t SSP1SSPPSbits __at(0x1EC7);
// bitfield macros
#define _SSP1SSPPS_SSP1SSPPS_POSN                           0x0
#define _SSP1SSPPS_SSP1SSPPS_POSITION                       0x0
#define _SSP1SSPPS_SSP1SSPPS_SIZE                           0x6
#define _SSP1SSPPS_SSP1SSPPS_LENGTH                         0x6
#define _SSP1SSPPS_SSP1SSPPS_MASK                           0x3F
#define _SSP1SSPPS_SSP1SSPPS0_POSN                          0x0
#define _SSP1SSPPS_SSP1SSPPS0_POSITION                      0x0
#define _SSP1SSPPS_SSP1SSPPS0_SIZE                          0x1
#define _SSP1SSPPS_SSP1SSPPS0_LENGTH                        0x1
#define _SSP1SSPPS_SSP1SSPPS0_MASK                          0x1
#define _SSP1SSPPS_SSP1SSPPS1_POSN                          0x1
#define _SSP1SSPPS_SSP1SSPPS1_POSITION                      0x1
#define _SSP1SSPPS_SSP1SSPPS1_SIZE                          0x1
#define _SSP1SSPPS_SSP1SSPPS1_LENGTH                        0x1
#define _SSP1SSPPS_SSP1SSPPS1_MASK                          0x2
#define _SSP1SSPPS_SSP1SSPPS2_POSN                          0x2
#define _SSP1SSPPS_SSP1SSPPS2_POSITION                      0x2
#define _SSP1SSPPS_SSP1SSPPS2_SIZE                          0x1
#define _SSP1SSPPS_SSP1SSPPS2_LENGTH                        0x1
#define _SSP1SSPPS_SSP1SSPPS2_MASK                          0x4
#define _SSP1SSPPS_SSP1SSPPS3_POSN                          0x3
#define _SSP1SSPPS_SSP1SSPPS3_POSITION                      0x3
#define _SSP1SSPPS_SSP1SSPPS3_SIZE                          0x1
#define _SSP1SSPPS_SSP1SSPPS3_LENGTH                        0x1
#define _SSP1SSPPS_SSP1SSPPS3_MASK                          0x8
#define _SSP1SSPPS_SSP1SSPPS4_POSN                          0x4
#define _SSP1SSPPS_SSP1SSPPS4_POSITION                      0x4
#define _SSP1SSPPS_SSP1SSPPS4_SIZE                          0x1
#define _SSP1SSPPS_SSP1SSPPS4_LENGTH                        0x1
#define _SSP1SSPPS_SSP1SSPPS4_MASK                          0x10
#define _SSP1SSPPS_SSP1SSPPS5_POSN                          0x5
#define _SSP1SSPPS_SSP1SSPPS5_POSITION                      0x5
#define _SSP1SSPPS_SSP1SSPPS5_SIZE                          0x1
#define _SSP1SSPPS_SSP1SSPPS5_LENGTH                        0x1
#define _SSP1SSPPS_SSP1SSPPS5_MASK                          0x20

// Register: RX1DTPPS
#define RX1DTPPS RX1DTPPS
extern volatile unsigned char           RX1DTPPS            __at(0x1ECB);
#ifndef _LIB_BUILD
asm("RX1DTPPS equ 01ECBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RX1DTPPS               :6;
    };
    struct {
        unsigned RX1DTPPS0              :1;
        unsigned RX1DTPPS1              :1;
        unsigned RX1DTPPS2              :1;
        unsigned RX1DTPPS3              :1;
        unsigned RX1DTPPS4              :1;
        unsigned RX1DTPPS5              :1;
    };
} RX1DTPPSbits_t;
extern volatile RX1DTPPSbits_t RX1DTPPSbits __at(0x1ECB);
// bitfield macros
#define _RX1DTPPS_RX1DTPPS_POSN                             0x0
#define _RX1DTPPS_RX1DTPPS_POSITION                         0x0
#define _RX1DTPPS_RX1DTPPS_SIZE                             0x6
#define _RX1DTPPS_RX1DTPPS_LENGTH                           0x6
#define _RX1DTPPS_RX1DTPPS_MASK                             0x3F
#define _RX1DTPPS_RX1DTPPS0_POSN                            0x0
#define _RX1DTPPS_RX1DTPPS0_POSITION                        0x0
#define _RX1DTPPS_RX1DTPPS0_SIZE                            0x1
#define _RX1DTPPS_RX1DTPPS0_LENGTH                          0x1
#define _RX1DTPPS_RX1DTPPS0_MASK                            0x1
#define _RX1DTPPS_RX1DTPPS1_POSN                            0x1
#define _RX1DTPPS_RX1DTPPS1_POSITION                        0x1
#define _RX1DTPPS_RX1DTPPS1_SIZE                            0x1
#define _RX1DTPPS_RX1DTPPS1_LENGTH                          0x1
#define _RX1DTPPS_RX1DTPPS1_MASK                            0x2
#define _RX1DTPPS_RX1DTPPS2_POSN                            0x2
#define _RX1DTPPS_RX1DTPPS2_POSITION                        0x2
#define _RX1DTPPS_RX1DTPPS2_SIZE                            0x1
#define _RX1DTPPS_RX1DTPPS2_LENGTH                          0x1
#define _RX1DTPPS_RX1DTPPS2_MASK                            0x4
#define _RX1DTPPS_RX1DTPPS3_POSN                            0x3
#define _RX1DTPPS_RX1DTPPS3_POSITION                        0x3
#define _RX1DTPPS_RX1DTPPS3_SIZE                            0x1
#define _RX1DTPPS_RX1DTPPS3_LENGTH                          0x1
#define _RX1DTPPS_RX1DTPPS3_MASK                            0x8
#define _RX1DTPPS_RX1DTPPS4_POSN                            0x4
#define _RX1DTPPS_RX1DTPPS4_POSITION                        0x4
#define _RX1DTPPS_RX1DTPPS4_SIZE                            0x1
#define _RX1DTPPS_RX1DTPPS4_LENGTH                          0x1
#define _RX1DTPPS_RX1DTPPS4_MASK                            0x10
#define _RX1DTPPS_RX1DTPPS5_POSN                            0x5
#define _RX1DTPPS_RX1DTPPS5_POSITION                        0x5
#define _RX1DTPPS_RX1DTPPS5_SIZE                            0x1
#define _RX1DTPPS_RX1DTPPS5_LENGTH                          0x1
#define _RX1DTPPS_RX1DTPPS5_MASK                            0x20

// Register: TX1CKPPS
#define TX1CKPPS TX1CKPPS
extern volatile unsigned char           TX1CKPPS            __at(0x1ECC);
#ifndef _LIB_BUILD
asm("TX1CKPPS equ 01ECCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TX1CKPPS               :6;
    };
    struct {
        unsigned TX1CKPPS0              :1;
        unsigned TX1CKPPS1              :1;
        unsigned TX1CKPPS2              :1;
        unsigned TX1CKPPS3              :1;
        unsigned TX1CKPPS4              :1;
        unsigned TX1CKPPS5              :1;
    };
} TX1CKPPSbits_t;
extern volatile TX1CKPPSbits_t TX1CKPPSbits __at(0x1ECC);
// bitfield macros
#define _TX1CKPPS_TX1CKPPS_POSN                             0x0
#define _TX1CKPPS_TX1CKPPS_POSITION                         0x0
#define _TX1CKPPS_TX1CKPPS_SIZE                             0x6
#define _TX1CKPPS_TX1CKPPS_LENGTH                           0x6
#define _TX1CKPPS_TX1CKPPS_MASK                             0x3F
#define _TX1CKPPS_TX1CKPPS0_POSN                            0x0
#define _TX1CKPPS_TX1CKPPS0_POSITION                        0x0
#define _TX1CKPPS_TX1CKPPS0_SIZE                            0x1
#define _TX1CKPPS_TX1CKPPS0_LENGTH                          0x1
#define _TX1CKPPS_TX1CKPPS0_MASK                            0x1
#define _TX1CKPPS_TX1CKPPS1_POSN                            0x1
#define _TX1CKPPS_TX1CKPPS1_POSITION                        0x1
#define _TX1CKPPS_TX1CKPPS1_SIZE                            0x1
#define _TX1CKPPS_TX1CKPPS1_LENGTH                          0x1
#define _TX1CKPPS_TX1CKPPS1_MASK                            0x2
#define _TX1CKPPS_TX1CKPPS2_POSN                            0x2
#define _TX1CKPPS_TX1CKPPS2_POSITION                        0x2
#define _TX1CKPPS_TX1CKPPS2_SIZE                            0x1
#define _TX1CKPPS_TX1CKPPS2_LENGTH                          0x1
#define _TX1CKPPS_TX1CKPPS2_MASK                            0x4
#define _TX1CKPPS_TX1CKPPS3_POSN                            0x3
#define _TX1CKPPS_TX1CKPPS3_POSITION                        0x3
#define _TX1CKPPS_TX1CKPPS3_SIZE                            0x1
#define _TX1CKPPS_TX1CKPPS3_LENGTH                          0x1
#define _TX1CKPPS_TX1CKPPS3_MASK                            0x8
#define _TX1CKPPS_TX1CKPPS4_POSN                            0x4
#define _TX1CKPPS_TX1CKPPS4_POSITION                        0x4
#define _TX1CKPPS_TX1CKPPS4_SIZE                            0x1
#define _TX1CKPPS_TX1CKPPS4_LENGTH                          0x1
#define _TX1CKPPS_TX1CKPPS4_MASK                            0x10
#define _TX1CKPPS_TX1CKPPS5_POSN                            0x5
#define _TX1CKPPS_TX1CKPPS5_POSITION                        0x5
#define _TX1CKPPS_TX1CKPPS5_SIZE                            0x1
#define _TX1CKPPS_TX1CKPPS5_LENGTH                          0x1
#define _TX1CKPPS_TX1CKPPS5_MASK                            0x20

// Register: RX2DTPPS
#define RX2DTPPS RX2DTPPS
extern volatile unsigned char           RX2DTPPS            __at(0x1ECD);
#ifndef _LIB_BUILD
asm("RX2DTPPS equ 01ECDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RX2DTPPS               :6;
    };
    struct {
        unsigned RX2DTPPS0              :1;
        unsigned RX2DTPPS1              :1;
        unsigned RX2DTPPS2              :1;
        unsigned RX2DTPPS3              :1;
        unsigned RX2DTPPS4              :1;
        unsigned RX2DTPPS5              :1;
    };
} RX2DTPPSbits_t;
